// 技名の名前解決

exports.moveList = {
	共通: {
		昇竜: ["623"],
		ターゲットコンボ1: ["タゲコン1"],
		ターゲットコンボ2: ["タゲコン2"],
		波動: [],
		ヨガ: [],
		逆ヨガ: [],
		前投げ: [],
		後ろ投げ: []
	},
	まこと: {
		特殊技: {
			山背: ["やませ", "山瀬"],
			
		},
		必殺技: {
			弱吹上: ["吹上弱", "弱昇竜"],
			中吹上: [],
			強吹上: [],
			EX吹上: []

			// 並列に置かないと。。
			// 疾風: {
			//     弱疾風: [],
			//     中疾風: [],
			//     強疾風: [],
			//     EX疾風: []
			// },
			// 颪: {
			//     弱颪: [],
			//     中颪: [],
			//     強颪: [],
			//     EX颪: []
			// },
			// 剣: {
			//     弱剣: [],
			//     中剣: [],
			//     強剣: [],
			//     EX剣: []
			// },
			// 唐草: {
			//     弱唐草: [],
			//     中唐草: [],
			//     強唐草: [],
			//     EX唐草: []
			// }
		}
  }
};