// ステータスデータ置き場

// ダメージ

exports.statusList = {
    まこと: {
        // 通常技, 必殺技, 特殊技で分ける？
        立弱P: {
            ダメージ: 30,
            スタン値: 50,
            ゲージ増量: 20,
            ヒット判定: '上段',
            発生: 4,
            持続: 4,
            硬直: 5,
            全体: 12,
            ガード有利: 2,
            ヒット有利: 5,
            ガード硬直: 11,
            喰らい硬直: 14,
            アマブレ: 'なし'
        },
        立中P: {

        },
        立強P: {

        },
        立弱K: {

        },
        立中K: {
            
        },
        立強K: {

        },
        前弱P: {

        },
        前中P: {
            
        },
        前強P: {

        },
        前弱K: {

        },
        前中K: {

        },
        前強K: {

        },
        屈弱P: {

        },
        屈中P: {

        },
        屈強P: {

        },
        屈弱K: {

        },
        屈中K: {

        },
        屈強K: {

        },
        山背: {

        },
        ターゲットコンボ1: {

        },
        ターゲットコンボ2: {

        },
        垂直J弱P: {

        },
        垂直J中P: {

        },
        垂直J強P: {

        },
        垂直J弱K: {

        },
        垂直J中K: {

        },
        垂直J強K: {

        },
        斜めJ弱P: {

        },
        斜めJ中P: {

        },
        斜めJ強P: {

        },
        斜めJ弱K: {

        },
        斜めJ中K: {

        },
        斜めJ強K: {

        },
        セービング1: {

        },
        セービング2: {

        },
        セービング3: {

        },
        塔頭: {
            // 前投げ
        },
        荒磯: {

        },
        弱吹上: {

        },
        中吹上: {

        },
        強吹上: {

        },
        EX吹上: {

        },
        弱疾風1: {

        },
        弱疾風2: {
            
        },
        弱疾風3: {
            
        },
        弱疾風4: {
            
        },
        弱疾風5: {
            
        },
        中疾風1: {
            
        },
        中疾風2: {
            
        },
        中疾風3: {
            
        },
        中疾風4: {
            
        },
        中疾風5: {
            
        },
        強疾風1: {
            
        },
        強疾風2: {
            
        },
        強疾風3: {
            
        },
        強疾風4: {
            
        },
        強疾風5: {
            
        },
        EX疾風: {
            
        },
        疾風キャンセル: {
            
        },
        弱颪: {

        },
        中颪: {

        },
        強颪: {

        },
        EX颪: {

        },
        弱唐草: {

        },
        中唐草: {

        },
        強唐草: {

        },
        EX唐草: {

        },
        弱剣: {

        },
        中剣: {

        },
        強剣: {

        },
        EX剣: {

        },
        スーパーコンボ: {

        },
        ウルトラコンボ1: {

        },
        ウルトラコンボ2: {
            
        }
    }
}

